# Задача No17. Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

# data = input("Введите числа: ").split() # перевод данных в список
# print(data) # ['10', '20', '30', '40']
# print(*data) # 10 20 30 40

data = [int(i) for i in input("Введите числа: ").split()] # 1 1 1 2 2 2 3
print(data) # [1, 1, 1, 2, 2, 2, 3]
print(set(data)) # {1, 2, 3}
print(len(set(data))) # 3 